{
    "nav": {
        "about": "About",
        "experience": "Experience",
        "skills": "Skills & Data",
        "projects": "Projects"
    },
    "header": {
        "title": "Andrej Dunaev",
        "subtitle": "Engineering Systems & AI Integration Specialist",
        "description": "Integrating engineering expertise with AI, data automation, and LLM-based solutions to build transparent and future-ready systems."
    },
    "about": {
        "p1": "I work at the intersection of engineering design, infrastructure operations, and modern AI-driven automation. Since 2006, I have been involved in the full lifecycle of gas pipeline and compressor station projects: from FEED and detailed design to commissioning support, technical documentation control, and regulatory compliance.",
        "p2": "For me, professional growth is not about climbing a career ladder, but about expanding horizons and applying expertise where it creates the most value. I believe in building systems that make complex processes transparent, reliable, and future-ready.",
        "p3": "Over the last three years, I have been actively integrating into the IT and AI ecosystem, focusing on Large Language Models (LLM) and engineering automation. I develop Python- and LLM-powered tools that classify technical documents, detect inconsistencies, generate analytical insights, and simplify complex engineering workflows. My work combines domain expertise with modern digital capabilities.",
        "p4": "My mission is to bridge traditional engineering with next-generation digital transformation, enabling infrastructure projects to operate with greater clarity, precision, and intelligence."
    },
    "experience": {
        "title": "Work Experience",
        "view_resume": "View Full Résumé",
        "jobs": {
            "idc-2": {
                "title": "Chief Engineering Expert (Project Management)",
                "description": [
                    "Provided comprehensive technical support for project and operational documentation, including pre-commissioning for main gas pipelines and compressor stations.",
                    "Developed automated Python scripts to generate comment sheets and analyze big data trends for equipment status.",
                    "Created detailed equipment maintenance checklists based on manufacturer documentation.",
                    "Prepared analytical data and technical conclusions for EPC contract documentation to resolve disputes.",
                    "Produced ~120 visual analytical reports comparing design vs. as-built conditions for legal claims."
                ]
            },
            "idc-1": {
                "title": "Chief Engineering Expert (Execution)",
                "description": [
                    "Coordinated realization of 400km main gas pipeline and compressor station construction.",
                    "Overseen Finalization of FEED and Detail Design documentation.",
                    "Managed coordination between design institutes (Saipem, Giprogazcentr, etc.), processing ~20,000 documents.",
                    "Implemented MDR/MDI procedures for automated data storage.",
                    "Participated in HAZOP reviews and ensured compliance with PED, ATEX, Ex, CE standards."
                ]
            },
            "gazprom": {
                "title": "Junior Project Coordinator",
                "description": [
                    "Coordinated a portfolio of 8+ major infrastructure projects valued from $30M to $23B.",
                    "Improved budget forecast accuracy by 5-10% through validated cost estimates.",
                    "Reduced schedule delay risks by 5-10% via early risk identification.",
                    "Facilitated ~250 stakeholder meetings with a 93-95% protocol action item completion rate."
                ]
            },
            "kuban": {
                "title": "Lead Design Engineer",
                "description": [
                    "Participated in establishing a new core department for main pipeline design.",
                    "Conducted technical expertise of design solutions for cost optimization.",
                    "Provided technical support to customer inspectors."
                ]
            },
            "yuzh-1": {
                "title": "Lead Design Engineer",
                "description": [
                    "Worked on 'South Stream' and 'Bovanenkovo — Ukhta' GTI projects.",
                    "Implemented 3D design solutions, increasing productivity by 50%.",
                    "Optimized design processes by linking Excel and AutoCAD.",
                    "Designed pig receiving/launching traps and valve stations in SolidWorks."
                ]
            }
        }
    },
    "skills": {
        "title": "Skills & Data",
        "description": "My expertise lies at the intersection of <0>Engineering</0>, <1>Project Management</1>, and <2>Data Analytics</2>. The interactive graph below illustrates how these fields are connected in my daily work — from automating checklist generation to managing 3D project integration.",
        "software": "Engineering Software",
        "digital": "Digital Tech & Analytics"
    },
    "projects": {
        "title": "Projects",
        "view_archive": "View Full Project Archive",
        "items": {
            "auto-comment-sheets": {
                "title": "Automated Documentation Generator",
                "description": "A Python-based automation tool designed to streamline the creation of engineering comment sheets and technical documentation. It processes structured data from Excel/CSV inputs to generate formatted reports, significantly reducing manual data entry time."
            },
            "pipeline-analytics": {
                "title": "Pipeline Data Analytics",
                "description": "Scripts for processing large datasets regarding gas pipeline equipment status. Visualizes design vs. as-built discrepancies for technical audits."
            },
            "portfolio-v2": {
                "title": "Engineering Portfolio V2",
                "description": "A modern, responsive portfolio website built with React and Tailwind CSS. Features interactive D3.js force graphs to visualize the connection between engineering skills, management, and data science."
            }
        }
    },
    "footer": {
        "built_with": "Designed and built with <0>React</0>, <1>Tailwind CSS</1>, and <2>D3.js</2>.",
        "inspired_by": "Inspired by the portfolio of Brittany Chiang."
    }
}